const SIMILAR_POST_COUNT = 25;

const DESCRIPTION_TEXTS = [
  'Описание фотографии - 1',
  'Описание фотографии - 2',
  'Описание фотографии - 3',
  'Описание фотографии - 4',
  'Описание фотографии - 5',
  'Описание фотографии - 6',
  'Описание фотографии - 7',
  'Описание фотографии - 8',
  'Описание фотографии - 9',
  'Описание фотографии - 10',
  'Описание фотографии - 11',
  'Описание фотографии - 12',
  'Описание фотографии - 13',
  'Описание фотографии - 14',
  'Описание фотографии - 15',
  'Описание фотографии - 16',
  'Описание фотографии - 17',
  'Описание фотографии - 18',
  'Описание фотографии - 19',
  'Описание фотографии - 20',
  'Описание фотографии - 21',
  'Описание фотографии - 22',
  'Описание фотографии - 23',
  'Описание фотографии - 24',
  'Описание фотографии - 25',
];

const USER_NAMES = [
  'Андрей',
  'Артем',
  'Иван',
  'Александр',
  'Алексей',
  'Богдан',
  'Павел',
  'Евгений',
  'Денис',
  'Анатолий',
  'Михаил',
  'Григорий',
  'Антон',
  'Аркадий',
  'Артур',
  'Борис',
  'Вадим',
  'Василий',
  'Виталий',
  'Геннадий',
  'Григорий',
  'Дмитрий',
  'Егор',
  'Игорь',
  'Леонид',
];

const USER_COMMENTS = [
  'Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!',
];

export {
  SIMILAR_POST_COUNT,
  DESCRIPTION_TEXTS,
  USER_NAMES,
  USER_COMMENTS
};
